In [1]:
import pandas as pd
import numpy as np

In [3]:
d = pd.Series({'a':100,'b':200,'c':300,'d':400})
d

a    100
b    200
c    300
d    400
dtype: int64

In [4]:
d1 = pd.Series({'a':100,'b':200,'c':300,'d':400},index=['a','e','f','d'])
d1

a    100.0
e      NaN
f      NaN
d    400.0
dtype: float64

### Dataframe

In [27]:
dt = pd.DataFrame({'Name':['Lily','Jasmine','Yuvraj','Tani'],'Roll_No':[101,102,103,104],'Courses':['AIML','Python','C','Java']})
dt

      Name  Roll_No Courses
0     Lily      101    AIML
1  Jasmine      102  Python
2   Yuvraj      103       C
3     Tani      104    Java

In [28]:
type(dt)

pandas.core.frame.DataFrame

In [29]:
# Accessing a specific columns value
dt.Courses[3]

'Java'

In [30]:
dt.Name[0]

'Lily'

In [31]:
# head() : returns the first top 5 values of the dataframe
dt.head()

      Name  Roll_No Courses
0     Lily      101    AIML
1  Jasmine      102  Python
2   Yuvraj      103       C
3     Tani      104    Java

In [32]:
# Returns the first specified datas of a dataframe. 
dt.head(2)

      Name  Roll_No Courses
0     Lily      101    AIML
1  Jasmine      102  Python

In [33]:
# tail() : returns the last 5 values of the dataframe.
dt.tail()

      Name  Roll_No Courses
0     Lily      101    AIML
1  Jasmine      102  Python
2   Yuvraj      103       C
3     Tani      104    Java

In [34]:
dt.tail(3)

      Name  Roll_No Courses
1  Jasmine      102  Python
2   Yuvraj      103       C
3     Tani      104    Java

In [35]:
# Slicing of dataframe: 
dt[::,::]

InvalidIndexError: (slice(None, None, None), slice(None, None, None))

In [36]:
# Slicing of dataframe: 
# iloc: this helps to perform slicing on Dataframe (iloc: Index Location)
dt.iloc[::,::]

      Name  Roll_No Courses
0     Lily      101    AIML
1  Jasmine      102  Python
2   Yuvraj      103       C
3     Tani      104    Java

In [37]:
dt.iloc[::2,::]

     Name  Roll_No Courses
0    Lily      101    AIML
2  Yuvraj      103       C

In [38]:
dt.iloc[::,::2]

      Name Courses
0     Lily    AIML
1  Jasmine  Python
2   Yuvraj       C
3     Tani    Java

In [39]:
# returns all rows and 2nd column 
dt.iloc[::,2]

0      AIML
1    Python
2         C
3      Java
Name: Courses, dtype: object

In [40]:
# renaming a columns name: 
dt = dt.rename(columns={'Name':'Students_Name'})
dt

  Students_Name  Roll_No Courses
0          Lily      101    AIML
1       Jasmine      102  Python
2        Yuvraj      103       C
3          Tani      104    Java

In [8]:
import pandas as pd
import numpy as np

In [9]:
df = pd.DataFrame({'Students_Name':['Lily','Jasmine','Yuvraj','Tani'],'Roll_No':[101,102,103,104],'Courses':['AIML','Python','C','Java']})
df

  Students_Name  Roll_No Courses
0          Lily      101    AIML
1       Jasmine      102  Python
2        Yuvraj      103       C
3          Tani      104    Java

In [11]:
# Set Index:
# it doesn't change the original value of dataframe It only changes for this instance.
df = df.set_index('Roll_No')
df

        Students_Name Courses
Roll_No
101              Lily    AIML
102           Jasmine  Python
103            Yuvraj       C
104              Tani    Java

In [13]:
df=df.set_index('Roll_No',inplace=True)

KeyError: "None of ['Roll_No'] are in the columns"

In [14]:
df

        Students_Name Courses
Roll_No
101              Lily    AIML
102           Jasmine  Python
103            Yuvraj       C
104              Tani    Java

In [16]:
# Working with null values:
d = pd.DataFrame({'Days':[1,2,3,4,5,6],'Places':['Odisha','Mumbai','Banglore','Chennai','Hyderabad','Ladakh'],'Visitors':[1000,2000,5000,6000,5200,8500]})
d

   Days     Places  Visitors
0     1     Odisha      1000
1     2     Mumbai      2000
2     3   Banglore      5000
3     4    Chennai      6000
4     5  Hyderabad      5200
5     6     Ladakh      8500

In [17]:
d = pd.DataFrame({'Days':[1,2,3,4,5,6],'Places':['Odisha',np.nan,'Banglore','Chennai','Hyderabad','Ladakh'],'Visitors':[1000,2000,5000,6000,5200,8500]})
d

   Days     Places  Visitors
0     1     Odisha      1000
1     2        NaN      2000
2     3   Banglore      5000
3     4    Chennai      6000
4     5  Hyderabad      5200
5     6     Ladakh      8500

In [18]:
# to check missing values
d.isnull()

    Days  Places  Visitors
0  False   False     False
1  False    True     False
2  False   False     False
3  False   False     False
4  False   False     False
5  False   False     False

In [19]:
# to check missing values at a time
d.isnull().sum()

Days        0
Places      1
Visitors    0
dtype: int64

In [20]:
# to replace the null value.
d.fillna('Mumbai')

   Days     Places  Visitors
0     1     Odisha      1000
1     2     Mumbai      2000
2     3   Banglore      5000
3     4    Chennai      6000
4     5  Hyderabad      5200
5     6     Ladakh      8500

In [21]:
d

   Days     Places  Visitors
0     1     Odisha      1000
1     2        NaN      2000
2     3   Banglore      5000
3     4    Chennai      6000
4     5  Hyderabad      5200
5     6     Ladakh      8500

In [23]:
# to replace the null value permanently.
d.fillna('Mumbai',inplace=True)
d

   Days     Places  Visitors
0     1     Odisha      1000
1     2     Mumbai      2000
2     3   Banglore      5000
3     4    Chennai      6000
4     5  Hyderabad      5200
5     6     Ladakh      8500

In [24]:
d.isnull().sum()

Days        0
Places      0
Visitors    0
dtype: int64

In [37]:
d = pd.DataFrame({'Days':[1,2,3,4,5,6],'Places':['Odisha',np.nan,'Banglore',np.nan,'Hyderabad','Ladakh'],'Visitors':[1000,2000,5000,6000,5200,8500]})
d

   Days     Places  Visitors
0     1     Odisha      1000
1     2        NaN      2000
2     3   Banglore      5000
3     4        NaN      6000
4     5  Hyderabad      5200
5     6     Ladakh      8500

In [39]:
d.isnull().sum()

Days        0
Places      2
Visitors    0
dtype: int64

In [40]:
d.fillna('Banglore',inplace=True)
d

   Days     Places  Visitors
0     1     Odisha      1000
1     2   Banglore      2000
2     3   Banglore      5000
3     4   Banglore      6000
4     5  Hyderabad      5200
5     6     Ladakh      8500

In [41]:
# returns the datatypes of every column of a dataframe
d.type()

AttributeError: 'DataFrame' object has no attribute 'type'

In [42]:
# returns all information of our dataframe
d.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Days      6 non-null      int64
 1   Places    6 non-null      object
 2   Visitors  6 non-null      int64
dtypes: int64(2), object(1)
memory usage: 276.0+ bytes

In [43]:
# to find the unique values
d.Places.unique()

array(['Odisha', 'Banglore', 'Hyderabad', 'Ladakh'], dtype=object)

In [44]:
# to find the average
d.Visitors.mean()

4616.666666666667

In [45]:
# to find maximum  value
d.Visitors.max()

8500

In [49]:
# to find all the statistical values present in our dataframe
# describe(): returns only statistical values of only integer columns
d.describe()

           Days     Visitors
count  6.000000     6.000000
mean   3.500000  4616.666667
std    1.870829  2735.263546
min    1.000000  1000.000000
25%    2.250000  2750.000000
50%    3.500000  5100.000000
75%    4.750000  5800.000000
max    6.000000  8500.000000

In [50]:
# returns the stastical values of only object columns
d.describe(include='O')

          Places
count          6
unique         4
top     Banglore
freq           3

In [52]:
# returns the stastical values of all the columns present in our datasets
d.describe(include='all')

            Days    Places     Visitors
count   6.000000         6     6.000000
unique       NaN         4          NaN
top          NaN  Banglore          NaN
freq         NaN         3          NaN
mean    3.500000       NaN  4616.666667
std     1.870829       NaN  2735.263546
min     1.000000       NaN  1000.000000
25%     2.250000       NaN  2750.000000
50%     3.500000       NaN  5100.000000
75%     4.750000       NaN  5800.000000
max     6.000000       NaN  8500.000000

### Working with Datasets

In [53]:
import numpy as np
import pandas as pd

In [55]:
# to read the dataset.
df = pd.read_csv(r"C:\Users\surya\Downloads\iris\iris.data")
df

     5.1  3.5  1.4  0.2     Iris-setosa
0    4.9  3.0  1.4  0.2     Iris-setosa
1    4.7  3.2  1.3  0.2     Iris-setosa
2    4.6  3.1  1.5  0.2     Iris-setosa
3    5.0  3.6  1.4  0.2     Iris-setosa
4    5.4  3.9  1.7  0.4     Iris-setosa
..   ...  ...  ...  ...             ...
144  6.7  3.0  5.2  2.3  Iris-virginica
145  6.3  2.5  5.0  1.9  Iris-virginica
146  6.5  3.0  5.2  2.0  Iris-virginica
147  6.2  3.4  5.4  2.3  Iris-virginica
148  5.9  3.0  5.1  1.8  Iris-virginica

[149 rows x 5 columns]

In [56]:
df = pd.read_csv(r"C:\Users\surya\Downloads\iris\iris.data",header=None)
df

       0    1    2    3               4
0    5.1  3.5  1.4  0.2     Iris-setosa
1    4.9  3.0  1.4  0.2     Iris-setosa
2    4.7  3.2  1.3  0.2     Iris-setosa
3    4.6  3.1  1.5  0.2     Iris-setosa
4    5.0  3.6  1.4  0.2     Iris-setosa
..   ...  ...  ...  ...             ...
145  6.7  3.0  5.2  2.3  Iris-virginica
146  6.3  2.5  5.0  1.9  Iris-virginica
147  6.5  3.0  5.2  2.0  Iris-virginica
148  6.2  3.4  5.4  2.3  Iris-virginica
149  5.9  3.0  5.1  1.8  Iris-virginica

[150 rows x 5 columns]